In [4]:
#file with header and footer
import pandas as pd
df1= pd.read_csv(r'C:\Users\ABIRAMI\OneDrive\Documents\2023-job_search\GIT-Repos\pandas\testing_data.txt')
df1

                                                    This is header
Index          Duration Date         Pulse Maxpulse       Calories
1              45       '2020/12/18' 90    112.0               NaN
2              45       NaN          100   119.0             282.0
3              60       '2020/12/23' 130   101.0             300.0
4              45       '2020/12/24' 105   132               246.0
5              60       '2020/12/25' 102   126               334.5
6              60       '20201226'   100   120.0             250.0
7              60       '2020/12/27' 92    118.0             241.0
8              60       '2020/12/27' 92    118.0             241.0
This is footer NaN      NaN          NaN   NaN                 NaN

In [9]:
#to read correctly
pd.read_table(r'C:\Users\ABIRAMI\OneDrive\Documents\2023-job_search\GIT-Repos\pandas\testing_data.txt', sep=',', skiprows=2, skipfooter=2, index_col=0)

<ipython-input-9-5289ce6f524a>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  pd.read_table(r'C:\Users\ABIRAMI\OneDrive\Documents\2023-job_search\GIT-Repos\pandas\testing_data.txt', sep=',', skiprows=2, skipfooter=2, index_col=0)

       Duration          Date  Pulse  Maxpulse  Calories
Index
1            45  '2020/12/18'     90     112.0       NaN
2            45           NaN    100     119.0     282.0
3            60  '2020/12/23'    130     101.0     300.0
4            45  '2020/12/24'    105     132.0     246.0
5            60  '2020/12/25'    102     126.0     334.5
6            60    '20201226'    100     120.0     250.0
7            60  '2020/12/27'     92     118.0     241.0
8            60  '2020/12/27'     92     118.0     241.0

In [10]:
#Resampling
import numpy as np
np.random.seed(0)
rng = pd.date_range('2015-02-24', periods=10, freq='T')
df = pd.DataFrame({'Val' : np.random.randn(len(rng))}, index=rng)
print (df)

                          Val
2015-02-24 00:00:00  1.764052
2015-02-24 00:01:00  0.400157
2015-02-24 00:02:00  0.978738
2015-02-24 00:03:00  2.240893
2015-02-24 00:04:00  1.867558
2015-02-24 00:05:00 -0.977278
2015-02-24 00:06:00  0.950088
2015-02-24 00:07:00 -0.151357
2015-02-24 00:08:00 -0.103219
2015-02-24 00:09:00  0.410599

In [11]:
"""This is typically done by aggregating or summarizing the data over a specified time period."""
print (df.resample('5Min').sum())

                          Val
2015-02-24 00:00:00  7.251399
2015-02-24 00:05:00  0.128833

In [12]:
#5Min is same as 5T
print (df.resample('5T').sum())

                          Val
2015-02-24 00:00:00  7.251399
2015-02-24 00:05:00  0.128833

In [13]:
#upsampling and fill NaN values method forward filling
"""upsampling and fill NaN values method forward filling
This is typically done by using interpolation or filling missing values."""
print (df.resample('30S').ffill())

                          Val
2015-02-24 00:00:00  1.764052
2015-02-24 00:00:30  1.764052
2015-02-24 00:01:00  0.400157
2015-02-24 00:01:30  0.400157
2015-02-24 00:02:00  0.978738
2015-02-24 00:02:30  0.978738
2015-02-24 00:03:00  2.240893
2015-02-24 00:03:30  2.240893
2015-02-24 00:04:00  1.867558
2015-02-24 00:04:30  1.867558
2015-02-24 00:05:00 -0.977278
2015-02-24 00:05:30 -0.977278
2015-02-24 00:06:00  0.950088
2015-02-24 00:06:30  0.950088
2015-02-24 00:07:00 -0.151357
2015-02-24 00:07:30 -0.151357
2015-02-24 00:08:00 -0.103219
2015-02-24 00:08:30 -0.103219
2015-02-24 00:09:00  0.410599

In [14]:
#Reshaping and pivoting

df = pd.DataFrame({'Name':['Mary', 'Josh','Jon','Lucy', 'Jane', 'Sue'],
 'Age':[34, 37, 29, 40, 29, 31],
 'City':['Boston','New York', 'Chicago', 'Los Angeles', 'Chicago',
'Boston'],
 'Position':['Manager','Programmer','Manager','Manager','Programmer',
'Programmer']},
 columns=['Name','Position','City','Age'])
print (df)

   Name    Position         City  Age
0  Mary     Manager       Boston   34
1  Josh  Programmer     New York   37
2   Jon     Manager      Chicago   29
3  Lucy     Manager  Los Angeles   40
4  Jane  Programmer      Chicago   29
5   Sue  Programmer       Boston   31

In [15]:
#Aggregate
print (df.pivot(index='Position', columns='City', values='Age'))

City        Boston  Chicago  Los Angeles  New York
Position
Manager       34.0     29.0         40.0       NaN
Programmer    31.0     29.0          NaN      37.0

In [16]:
print (df.pivot(index='Position', columns='City', values='Age')
 .reset_index()
 .rename_axis(None, axis=1)
 .fillna(0))

     Position  Boston  Chicago  Los Angeles  New York
0     Manager    34.0     29.0         40.0       0.0
1  Programmer    31.0     29.0          0.0      37.0

In [17]:
print (df.pivot(index='Position', columns='City', values='Name'))

City       Boston Chicago Los Angeles New York
Position
Manager      Mary     Jon        Lucy      NaN
Programmer    Sue    Jane         NaN     Josh

In [22]:
np.random.seed(0)
tuples = list(zip(*[['bar', 'bar', 'foo', 'foo', 'qux', 'qux'],
 ['one', 'two', 'one', 'two','one', 'two']]))
idx = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(6, 2), index=idx, columns=['A', 'B'])
print (df)

                     A         B
first second
bar   one     1.764052  0.400157
      two     0.978738  2.240893
foo   one     1.867558 -0.977278
      two     0.950088 -0.151357
qux   one    -0.103219  0.410599
      two     0.144044  1.454274

In [23]:
#stack and unstack
print (df.stack())

first  second
bar    one     A    1.764052
               B    0.400157
       two     A    0.978738
               B    2.240893
foo    one     A    1.867558
               B   -0.977278
       two     A    0.950088
               B   -0.151357
qux    one     A   -0.103219
               B    0.410599
       two     A    0.144044
               B    1.454274
dtype: float64

In [24]:
print (df.unstack())

               A                   B
second       one       two       one       two
first
bar     1.764052  0.978738  0.400157  2.240893
foo     1.867558  0.950088 -0.977278 -0.151357
qux    -0.103219  0.144044  0.410599  1.454274

In [25]:
#cross tabulation
df = pd.DataFrame({'Sex': ['M', 'M', 'F', 'M', 'F', 'F', 'M', 'M', 'F', 'F'],
 'Age': [20, 19, 17, 35, 22, 22, 12, 15, 17, 22],
 'Heart Disease': ['Y', 'N', 'Y', 'N', 'N', 'Y', 'N', 'Y', 'N', 'Y']})
df

  Sex  Age Heart Disease
0   M   20             Y
1   M   19             N
2   F   17             Y
3   M   35             N
4   F   22             N
5   F   22             Y
6   M   12             N
7   M   15             Y
8   F   17             N
9   F   22             Y

In [26]:
pd.crosstab(df['Sex'], df['Heart Disease'])

Heart Disease  N  Y
Sex
F              2  3
M              3  2

In [27]:
pd.crosstab(df.Sex, df.Age)

Age  12  15  17  19  20  22  35
Sex
F     0   0   2   0   0   3   0
M     1   1   0   1   1   0   1

In [28]:
pd.crosstab(df.Sex, df.Age).T

Sex  F  M
Age
12   0  1
15   0  1
17   2  0
19   0  1
20   0  1
22   3  0
35   0  1

In [29]:
pd.crosstab(df['Sex'], df['Heart Disease'], margins=True)

Heart Disease  N  Y  All
Sex
F              2  3    5
M              3  2    5
All            5  5   10

In [30]:
pd.crosstab(df['Sex'], df['Age'], margins=True).T

Sex  F  M  All
Age
12   0  1    1
15   0  1    1
17   2  0    2
19   0  1    1
20   0  1    1
22   3  0    3
35   0  1    1
All  5  5   10

In [31]:
pd.crosstab(df["Sex"],df['Heart Disease']).apply(lambda r: r/len(df), axis=1)

Heart Disease    N    Y
Sex
F              0.2  0.3
M              0.3  0.2

In [32]:
df2 = pd.crosstab(df["Age"],df['Sex'], margins=True ).apply(lambda r: r/len(df)*100, axis=1)
df2

Sex     F     M    All
Age
12    0.0  10.0   10.0
15    0.0  10.0   10.0
17   20.0   0.0   20.0
19    0.0  10.0   10.0
20    0.0  10.0   10.0
22   30.0   0.0   30.0
35    0.0  10.0   10.0
All  50.0  50.0  100.0

In [33]:
df2[["F","M"]]

Sex     F     M
Age
12    0.0  10.0
15    0.0  10.0
17   20.0   0.0
19    0.0  10.0
20    0.0  10.0
22   30.0   0.0
35    0.0  10.0
All  50.0  50.0

In [34]:
#Split (reshape) CSV strings in columns into multiple rows, having one element
#per row

df = pd.DataFrame([{'var1': 'a,b,c', 'var2': 1, 'var3': 'XX'},
 {'var1': 'd,e,f,x,y', 'var2': 2, 'var3': 'ZZ'}])
print(df)
reshaped = \
(df.set_index(df.columns.drop('var1',1).tolist())
 .var1.str.split(',', expand=True)
 .stack()
 .reset_index()
 .rename(columns={0:'var1'})
 .loc[:, df.columns]
)
print(reshaped)

        var1  var2 var3
0      a,b,c     1   XX
1  d,e,f,x,y     2   ZZ
  var1  var2 var3
0    a     1   XX
1    b     1   XX
2    c     1   XX
3    d     2   ZZ
4    e     2   ZZ
5    f     2   ZZ
6    x     2   ZZ
7    y     2   ZZ

In [36]:
#Series
import pandas as pd
s = pd.Series([10, 20, 30])
s

0    10
1    20
2    30
dtype: int64

In [38]:
s2 = pd.Series([1.5, 2.5, 3.5], index=['a', 'b', 'c'], name='my_series')
s2

a    1.5
b    2.5
c    3.5
Name: my_series, dtype: float64

In [40]:
s3 = pd.Series(['a', 'b', 'c'], index=list('ABC'))
s3

A    a
B    b
C    c
dtype: object

In [41]:
len(s3)

3

In [46]:
s3['B']

'b'

In [49]:
s3.loc['A']

'a'

In [50]:
s3[1:3]

B    b
C    c
dtype: object

In [52]:
s[s > 20]

2    30
dtype: int64

In [53]:
s.min()

10

In [54]:
s.max()

30

In [55]:
 s.mean()

20.0

In [56]:
 s.std()

10.0

In [57]:
s.astype(float)

0    10.0
1    20.0
2    30.0
dtype: float64

In [58]:
s.values

array([10, 20, 30], dtype=int64)

In [60]:
d = s.copy()
d

0    10
1    20
2    30
dtype: int64

In [62]:
#Applying a function to a Series
s = pd.Series([3, 7, 5, 8, 9, 1, 0, 4])
s

0    3
1    7
2    5
3    8
4    9
5    1
6    0
7    4
dtype: int64

In [65]:
def square(x):
    return x*x

t = s.apply(square)
t

0     9
1    49
2    25
3    64
4    81
5     1
6     0
7    16
dtype: int64

In [67]:
#lambda
s.apply(lambda x: x ** 2)

0     9
1    49
2    25
3    64
4    81
5     1
6     0
7    16
dtype: int64